zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_i2s.c
  if ((pTxData == NULL) || (pRxData == NULL) || (Size == 0U))
  {
    return  HAL_ERROR;
  }

  /* Process Locked */
  __HAL_LOCK(hi2s);

  /* Init tickstart for timeout management*/
  tickstart = HAL_GetTick();

  hi2s->TxXferSize  = Size;
  hi2s->TxXferCount = Size;
  hi2s->pTxBuffPtr  = pTxData;
  hi2s->RxXferSize  = Size;
  hi2s->RxXferCount = Size;
  hi2s->pRxBuffPtr  = pRxData;

  /* Set state and reset error code */
  hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
  hi2s->State = HAL_I2S_STATE_BUSY_TX_RX;

  /* Check if the I2S is already enabled */
  if ((hi2s->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
  {
    /* Enable I2S peripheral */
    __HAL_I2S_ENABLE(hi2s);
  }

  /* Start the transfer */
  SET_BIT(hi2s->Instance->CR1, SPI_CR1_CSTART);

  uint16_t tmpTxXferCount = hi2s->TxXferCount;
  uint16_t tmpRxXferCount = hi2s->RxXferCount;
  while ((tmpTxXferCount > 0UL) || (tmpRxXferCount > 0UL))
  {

    if ((__HAL_I2S_GET_FLAG(hi2s, I2S_FLAG_TXP) == SET))
    {
      if (hi2s->TxXferCount > 0UL)
      {
        if ((hi2s->Init.DataFormat == I2S_DATAFORMAT_24B) || (hi2s->Init.DataFormat == I2S_DATAFORMAT_32B))
        {

          /* Transmit data in 32 Bit mode */
          hi2s->Instance->TXDR = *((uint32_t *)hi2s->pTxBuffPtr);
          hi2s->pTxBuffPtr += 2;
          hi2s->TxXferCount--;
        }
      }
      else
      {
        if (hi2s->Init.FifoThreshold > I2S_FIFO_THRESHOLD_01DATA)
        {
          if (hi2s->TxXferCount > 1UL)
          {
            hi2s->Instance->TXDR = *((uint32_t *)hi2s->pTxBuffPtr);
            hi2s->pTxBuffPtr += 2;
            hi2s->TxXferCount -= 2U;
          }
        }

        else /* Transmit data in 16 Bit mode */
        {
#if defined (__GNUC__)
          *ptxdr_16bits = *((uint16_t *)hi2s->pTxBuffPtr);
#else
          *((__IO uint16_t *)&hi2s->Instance->TXDR) = *((uint16_t *)hi2s->pTxBuffPtr);
#endif /* __GNUC__ */

          hi2s->pTxBuffPtr++;
          hi2s->TxXferCount--;
        }
      }

      /* Check if an underrun occurs */
      if (__HAL_I2S_GET_FLAG(hi2s, I2S_FLAG_UDR) == SET)
      {
        /* Clear underrun flag */
        __HAL_I2S_CLEAR_UDRFLAG(hi2s);

        /* Set the error code */
        SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_UDR);
      }
    }

    if ((hi2s->Instance->SR & (I2S_FLAG_RXP | I2S_FLAG_RXWNE)) != 0UL)
    {
      if (hi2s->RxXferCount > 0UL)
      {
        if ((hi2s->Init.DataFormat == I2S_DATAFORMAT_24B) || (hi2s->Init.DataFormat == I2S_DATAFORMAT_32B))
        {
          /* Receive data in 32 Bit mode */
          *((uint32_t *)hi2s->pRxBuffPtr) = hi2s->Instance->RXDR;
          hi2s->pRxBuffPtr += 2;
          hi2s->RxXferCount--;
        }
      }
      else /* Receive data in 16 Bit mode */
      {
        /* Check RXWNE flag */
        if ((hi2s->Instance->SR & I2S_FLAG_RXWNE) != 0UL)
        {
          if (hi2s->RxXferCount > 1UL)
          {
            *((uint32_t *)hi2s->pRxBuffPtr) = hi2s->Instance->RXDR;
            hi2s->pRxBuffPtr += 2;
            hi2s->RxXferCount -= 2U;
          }
        }
        else
        {

#if defined (__GNUC__)
          *((uint16_t *)hi2s->pRxBuffPtr) = *prxdr_16bits;
#else
          *((uint16_t *)hi2s->pRxBuffPtr) = *((__IO uint16_t *)&hi2s->Instance->RXDR);
#endif /* __GNUC__ */
          hi2s->pRxBuffPtr++;
          hi2s->RxXferCount--;
        }
      }

      /* Check if an overrun occurs */
      if (__HAL_I2S_GET_FLAG(hi2s, I2S_FLAG_OVR) == SET)
      {
        /* Clear overrun flag */
        __HAL_I2S_CLEAR_OVRFLAG(hi2s);

        /* Set the error code */
        SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_OVR);
      }
    }

    /* Timeout management */
    if ((((HAL_GetTick() - tickstart) >=  Timeout) && (Timeout != HAL_MAX_DELAY)) || (Timeout == 0U))
    {
      /* Set the error code */
      SET_BIT(hi2s->ErrorCode, HAL_I2S_ERROR_TIMEOUT);
      hi2s->State = HAL_I2S_STATE_READY;
      __HAL_UNLOCK(hi2s);
      return HAL_TIMEOUT;
    }
  }

  hi2s->State = HAL_I2S_STATE_READY;
  __HAL_UNLOCK(hi2s);
  return HAL_OK;
}

/**
  * @brief  Transmit an amount of data in non-blocking mode with Interrupt
  * @param  hi2s pointer to a I2S_HandleTypeDef structure that contains
  *         the configuration information for I2S module
  * @param  pData a 16-bit pointer to data buffer.
  * @param  Size number of data sample to be sent:
  * @note   When a 16-bit data frame or a 16-bit data frame extended is selected during the I2S
  *         configuration phase, the Size parameter means the number of 16-bit data length
  *         in the transaction and when a 24-bit data frame or a 32-bit data frame is selected
  *         the Size parameter means the number of 16-bit data length.
  * @note   The I2S is kept enabled at the end of transaction to avoid the clock de-synchronization
  *         between Master and Slave(example: audio streaming).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_I2S_Transmit_IT(I2S_HandleTypeDef *hi2s, uint16_t *pData, uint16_t Size)
{
  if ((pData == NULL) || (Size == 0UL))
  {
    return  HAL_ERROR;
  }

  /* Process Locked */
  __HAL_LOCK(hi2s);

  if (hi2s->State != HAL_I2S_STATE_READY)
  {
    __HAL_UNLOCK(hi2s);
    return HAL_BUSY;
  }

  /* Set state and reset error code */
  hi2s->State       = HAL_I2S_STATE_BUSY_TX;
  hi2s->ErrorCode   = HAL_I2S_ERROR_NONE;
  hi2s->pTxBuffPtr  = (uint16_t *)pData;
  hi2s->TxXferSize  = Size;
  hi2s->TxXferCount = Size;

  /* Initialize fields not used in handle to zero */
  hi2s->pRxBuffPtr  = NULL;
  hi2s->RxXferSize  = (uint16_t) 0UL;
  hi2s->RxXferCount = (uint16_t) 0UL;

  /* Set the function for IT treatment */
  if ((hi2s->Init.DataFormat == I2S_DATAFORMAT_24B) || (hi2s->Init.DataFormat == I2S_DATAFORMAT_32B))
  {
    hi2s->TxISR = I2S_Transmit_32Bit_IT;
  }
  else
  {
    hi2s->TxISR = I2S_Transmit_16Bit_IT;
  }

  /* Check if the I2S is already enabled */
  if ((hi2s->Instance->CR1 & SPI_CR1_SPE) != SPI_CR1_SPE)
  {
    /* Enable I2S peripheral */
    __HAL_I2S_ENABLE(hi2s);
  }

